app/controllers/coffee_shops_controller.rb

SELECT  "coffee_shops".* FROM "coffee_shops" ORDER BY "coffee_shops"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    render json: CoffeeShop.all

INSERT INTO "coffee_shops" ("name", "description", "website", "address", "price_range", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "El Beit"], ["description", ""], ["website", ""], ["address", ""], ["price_range", ""], ["created_at", "2017-06-07 12:21:28.983803"], ["updated_at", "2017-06-07 12:21:28.983803"]]
---
  def create
    @coffee_shop = CoffeeShop.new(coffee_shop_params)
    if @coffee_shop.save

SELECT  "coffee_shops".* FROM "coffee_shops" WHERE "coffee_shops"."id" = ? LIMIT ?  [["id", 61], ["LIMIT", 1]]
---
  def show
    @coffee_shop = CoffeeShop.find(params[:id])

SELECT  "coffee_shops".* FROM "coffee_shops" WHERE "coffee_shops"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]
UPDATE "coffee_shops" SET "votes" = ?, "updated_at" = ? WHERE "coffee_shops"."id" = ?  [["votes", 1], ["updated_at", "2017-06-17 16:11:54.126573"], ["id", 68]]
---
  def update
    @coffee_shop = CoffeeShop.find(params[:id])
    @coffee_shop.update(coffee_shop_params)