app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    respond_to do |f|
      f.json {render json: User.all}